app/controllers/games_controller.rb

SELECT `games`.* FROM `games`
---
  def index
    @games = Game.all

SELECT `games`.* FROM `games` WHERE `games`.`id` = 1 LIMIT 1
---
  def show
    @game = Game.find(params[:id])

SELECT `games`.* FROM `games` WHERE `games`.`id` = 1 LIMIT 1
---
  def edit
    @game = Game.find(params[:id])

INSERT INTO `games` (`created_at`, `description`, `developer`, `publisher`, `released`, `title`, `updated_at`) VALUES ('2013-07-26 07:47:45', 'An awesome game for adventures', 'Bethesda', 'Bethesda', '2011-11-11', 'Skyrim', '2013-07-26 07:47:45')
---
  def create
    @game = Game.new(params[:game])

    respond_to do |format|
      if @game.save

SELECT `games`.* FROM `games` WHERE `games`.`id` = 3 LIMIT 1
DELETE FROM `games` WHERE `games`.`id` = 3
---
  def destroy
    @game = Game.find(params[:id])
    @game.destroy